#Напишите программу, в которой 
#пользователь будет задавать две строки, а программа - определять количество вхождений одной строки в другой.
s = input('Введите строку')
s1 = input('Введите строку ')
print(s.count(s1))